/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memcpy.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: oargrave <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2018/11/22 15:26:34 by oargrave          #+#    #+#             */
/*   Updated: 2018/11/22 15:38:26 by oargrave         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void	*ft_memcpy(void *dst, const void *src, size_t n)
{
	int index;

	index = 0;
	while (index != n)
	{
		dst[index] = src[index];
		index++;
	}
	return (dst);
	// можнло дописать условия проверки ДЗ
}
